{
  "basics": {
    "name": "Charlie Groll",
    "label": "Software developer",
    "picture": "",
    "email": "charliegroll@gmail.com",
    "phone": "201.787.3253",
    "website": "",
    "summary": "Charlie is from New Jersey, born and raised, and got his bachelor’s from Rutgers, the State University of New Jersey. He’s currently happily employeed at Opower/Oracle, where Javascript is his weapon of choice. Outside of work, he leads a fairly active life of cycling, running, climbing, volleyballing, and the occasional hiking or backpacking trip.",
    "location": {
      "address": "",
      "postalCode": "20010",
      "city": "Washington",
      "countryCode": "US",
      "region": "DC"
    },
    "profiles": []
  },
  "work": [
    {
      "company": "Opower/Oracle",
      "position": "Senior Web Developer - Web Application Platform",
      "website": "https://opower.com",
      "startDate": "2019-07-31",
      "endDate": "2020-08-01",
      "summary": "Javascript developer responsible for developing build systems for the Web Product teams and development of a new configuration tool called Symphony.",
      "highlights": [
        "Full-stack javascript development for Symphony, a tool built to let clients configure our web products themselves, esentially making the process self-serve.",
        "Updates to, and maintenance of, various intricate build systems with a mind for backwards-compatibility, developer experience, and product/ecosystem goals",
        "Creation of a new CSR portal experience to take advantage of the latest build system features",
        "Changes to the unified Webpack setup",
        "Active point of contact for platform questions from Delivery Teams, Web Product developers, etc."
      ]
    },
    {
      "company": "Opower/Oracle",
      "position": "Senior Web Developer - Web Product",
      "website": "https://opower.com",
      "startDate": "2017-08-04",
      "endDate": "2019-07-31",
      "summary": "Javascript developer on a small SCRUM team responsible for several core-business web products.",
      "highlights": [
        "Developed website components for some of the biggest utility websites in the country",
        "Championed adaptation and migration to React",
        "Work closely with product owners to turn feature requests into reality",
        "Written unit, integration, and browser tests and knowing which is right for the job",
        "Unappointed liaison between the Web Product tribe and Web Platform and Delivery teams",
        "Led introduction of Redux into the product development stack",
        "Written RFCs for development process improvement",
        "Mentored junior developers"
      ]
    },
    {
      "company": "Verizon Wireless",
      "position": "Lead UI Developer and Team Lead",
      "website": "https://verizonwireless.com/",
      "startDate": "2012-06-11",
      "endDate": "2017-07-28",
      "summary": "Worked on the eCommerce team to provide a portal for over 1 million people per day to shop for phones, accessories, and wireless service packages. Collaborated with business partners and UX/visual designers, test and debug sites for accessibility issues, and oversee a small team to ensure code quality in rapid development cycles to provide the best experience possible.",
      "highlights": [
        "Led a team of 5-7 developers",
        "Designed front-end architecture and standards",
        "One of three development leads at the forefront of rewriting the entire eCommerce site with React/Redux",
        "Built intimate relationships with business stakeholders and visual designers",
        "Re-architected the UI development stack for MyVerizon with Angular from jQuery/JSP logic",
        "Optimized MyVerizon static assets workflow with Grunt"
      ]
    },
    {
      "company": "Rutgers University Office of Instructional and Research Technology",
      "position": "Junior Application Developer",
      "website": "https://sakai.rutgers.edu/",
      "startDate": "2011-05-01",
      "endDate": "2012-05-01",
      "summary": "Charlie worked on bug fixes and module integrations on Rutgers’s implementation of the open-source CMS known as Sakai, which saw over 40,000 users per week.",
      "highlights": []
    }
  ],
  "volunteer": [
    {
      "organization": "Urban Rivers",
      "position": "Web Developer",
      "website": "https://patagonia.catchafire.org/volunteer/43855/urban-rivers--flexible-web-development-support/",
      "startDate": "2020-06-19",
      "endDate": "2017-08-01",
      "summary": "Implemented updates and improvements to a web tool for tracking the organization's floating gardens",
      "highlights": [
        "1 of 3 on a team, and the only one with professional development experience"
      ]
    },
    {
      "organization": "Parsippany Volunteer Ambulance Squad",
      "position": "Lieutenant",
      "website": "",
      "startDate": "2008-05-01",
      "endDate": "2017-06-05",
      "summary": "Emergency Medical Services for the town of Parsippany, NJ",
      "highlights": [
        "Experience as a Trustee, on the Grievance Committee, and on the Background Committee"
      ]
    }
  ],
  "education": [
    {
      "institution": "Rutgers University",
      "area": "Information Technology and Informatics, Psychology, minor in Computer Science",
      "startDate": "2008-09-01",
      "endDate": "2012-05-01",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [
    {
      "title": "2013 Recognition Award",
      "date": "2013-06-01",
      "awarder": "Executive Director of eCommerce, Self-Serve, and Products",
      "summary": "Awarded for exceptional work on a large-scale, full-site migration of all data and templates related to https://www.verizonwireless.com/support/ onto Adobe CQ5"
    }
  ],
  "publications": [],
  "skills": [
    {
      "name": "Web Development",
      "level": "",
      "keywords": [
        "HTML",
        "CSS",
        "Build tools (Webpack, Babel)",
        "Accessibility",
        "Material UI"
      ]
    },
    {
      "name": "Javascript",
      "level": "",
      "keywords": [
        "React",
        "Hooks",
        "Node",
        "Koa",
        "Redux",
        "Angular 1.6",
        "Backbone",
        "jQuery"
      ]
    },
    {
      "name": "Misc.",
      "level": "",
      "keywords": [
        "Continuous Integration",
        "Writing unit, integration/browser, and e2e tests",
        "TDD",
        "git",
        "Github",
        "SQL"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": [],
  "references": []
}
